In [1]:
import pandas as pd

In [2]:
cities=["Casablanca","Rabat","Safi","Al Jadida"]
weather = [12,23,9,10]

In [3]:
list_col=[cities,weather]
list_label = ["City","Weather"]

In [13]:
zipped__lists=dict(list(zip(list_label,list_col)))

In [14]:
DATA=pd.DataFrame(zipped__lists)

In [16]:
DATA.set_index("City")

            Weather
City
Casablanca       12
Rabat            23
Safi              9
Al Jadida        10

In [30]:
DATA["TEMERATURE"]=[12,18,24,20]

In [31]:
DATA

         City  Weather fees  TEMERATURE
0  Casablanca       12   12          12
1       Rabat       23   18          18
2        Safi        9   24          24
3   Al Jadida       10               20

In [33]:
DATA.index=["&","~","#","|"]
DATA

         City  Weather fees  TEMERATURE
&  Casablanca       12   12          12
~       Rabat       23   18          18
#        Safi        9   24          24
|   Al Jadida       10               20